{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "78810e25",
   "metadata": {},
   "source": [
    "### Генерация самого вероятного предложения на основе текста\n",
    "\n",
    "Напишите программу, которая анализирует большой текст (например, книгу) и строит на его основе вероятностную модель слов — так называемую биграммную модель.\n",
    "\n",
    "Биграммы — это пары слов, идущие друг за другом в тексте. Например, в предложении:\n",
    "\n",
    "    \"Мама мыла раму\"\n",
    "\n",
    "биграммы будут:\n",
    "\n",
    "    (\"Мама\", \"мыла\")\n",
    "\n",
    "    (\"мыла\", \"раму\")\n",
    "\n",
    "Биграммная модель хранит, какие слова чаще всего следуют за каждым словом. Это позволяет предсказывать следующее слово с учётом предыдущего.\n",
    "\n",
    "Что должна делать программа:\n",
    "\n",
    "1. Прочитать текст из файла (.txt).\n",
    "\n",
    "2. Разбить текст на слова (можно использовать `split()`).\n",
    "\n",
    "3. Построить словарь биграмм, где:\n",
    "\n",
    "Ключ — слово\n",
    "\n",
    "Значение — словарь всех слов, которые шли после него, с количеством вхождений\n",
    "\n",
    "4. Случайным образом выбрать первое слово.\n",
    "\n",
    "5. Постепенно строить предложение, каждый раз выбирая наиболее вероятное следующее слово (т.е. то, что встречается чаще всего после текущего). Добавлять слова в список.\n",
    "\n",
    "6. Завершить построение, если выбранное слово заканчивается на точку, вопросительный или восклицательный знак или длина предложения превышает 15 слов.\n",
    "\n",
    "7. Соединить список с помощью `join()` и вывести получившееся предложение на экран.\n",
    "\n",
    "**Подсказки:**\n",
    "\n",
    "1. Используйте модуль `random` для выбора первого слова:\n",
    "\n",
    "```python\n",
    "import random\n",
    "\n",
    "students = [\"Smith\", \"Jones\", \"Stevens\"]\n",
    "on_duty = random.choice(students)\n",
    "```\n",
    "\n",
    "2. Чтобы найти наиболее вероятное следующее слово, используйте функцию `max`.\n",
    "\n",
    "```python\n",
    "average_marks = {\n",
    "    \"Smith\": 3.8,\n",
    "    \"Jones\": 4.2,\n",
    "    \"Stevens\": 4.1,\n",
    "}\n",
    "top_student = max(average_marks, key=average_marks.get)\n",
    "```\n",
    "\n",
    "3. Как создать словарь биграмм:\n",
    "\n",
    "```\n",
    "Считать текст из файла и сохранить в переменную text\n",
    "Привести текст к нижнему регистру\n",
    "Разбить текст на список слов (например, по пробелам) и сохранить в переменную words\n",
    "\n",
    "Создать пустой словарь bigrams\n",
    "\n",
    "ДЛЯ КАЖДОГО индекса i от 0 до длины списка words - 1 (не включая):\n",
    "    текущее_слово = words[i]\n",
    "    следующее_слово = words[i + 1]\n",
    "\n",
    "    ЕСЛИ текущее_слово не находится в словаре bigrams:\n",
    "        добавить текущее_слово в словарь bigrams и присвоить ему пустой словарь\n",
    "\n",
    "    ЕСЛИ следующее_слово не находится в словаре bigrams[текущее_слово]:\n",
    "        добавить следующее_слово в словарь bigrams[текущее_слово] со значением 1\n",
    "    ИНАЧЕ:\n",
    "        увеличить значение bigrams[текущее_слово][следующее_слово] на 1\n",
    "```\n",
    "\n",
    "В качестве текста используйте \"Войну и мир\" (скачать отсюда: https://gist.githubusercontent.com/romaklimenko/c95f3a864828f7f034b7a33d1676e420/raw/55f9027799b5b3c67e2f7cb3d6a7154f707ff08a/warandpeace.txt) или любой другой текст."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "865557af",
   "metadata": {},
   "source": [
    "Домашнее задание:\n",
    "\n",
    "1. Перепишите код в тетрадь\n",
    "2. Измените код так, чтобы каждый раз выбиралось не самое вероятное слово, а использовалась функция `random.choices()`. Тогда вы сможете использовать веса и получать разные слова с разной вероятностью. Эта функция возвращает список, поэтому надо взять первый элемент (`[0]`). Веса (то есть список количеств раз, которые встретилось каждое слово) нужно передать в параметр `weights`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "486502df",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 \n",
      "---\n",
      "8 1 8 1 8 8 7 8 8 8 8 8 2 10 10 8 10 10 8 8 "
     ]
    }
   ],
   "source": [
    "import random\n",
    "\n",
    "nums = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]\n",
    "weights = [5, 3, 1, 1, 2, 3, 4, 20, 4, 5]\n",
    "\n",
    "nums_with_weights = {}\n",
    "for i in range(len(nums)):\n",
    "    nums_with_weights[nums[i]] = weights[i]\n",
    "\n",
    "# до: детерминированный результат\n",
    "\n",
    "for i in range(20):\n",
    "    print(max(nums_with_weights, key=nums_with_weights.get), end=\" \")\n",
    "print(\"\\n---\")\n",
    "\n",
    "# после: вероятностный результат\n",
    "\n",
    "for i in range(20):\n",
    "    weights = list(nums_with_weights.values())\n",
    "    print(random.choices(nums, weights=weights)[0], end=\" \")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
